fonecmid-diplom/src/InformationRegisters/ВКМ_ОчередьУведомленийTelegram/ВКМ_ОчередьУведомленийTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ОчередьУведомленийTelegram</name>
  <periodicity>WithinSecond</periodicity>
  <writeMode>Independent</writeMode>
  <dimensions>
    <name>ВКМ_Ключ</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_ТекстУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_МаршрутизацияTelegramКонтрагентов/ВКМ_МаршрутизацияTelegramКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_МаршрутизацияTelegramКонтрагентов</name>
  <periodicity>WithinSecond</periodicity>
  <writeMode>Independent</writeMode>
  <dimensions>
    <name>ВКМ_Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_ИдентификаторЧата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

fonecmid-diplom/src/CommonModules/ВКМ_ОбслуживаниеКлиентов/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВКМ_ОтправитьУведомлениеВТелеграм(Контрагент, ТекстУведомления) Экспорт

	Результат = Новый Структура("Успешно, ТекстОшибки, КодСостояния", Ложь, "", 0);
	Если НЕ ЗначениеЗаполнено(ТекстУведомления) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Не задан текст уведомления.'");
		Возврат Результат;
	КонецЕсли;

	ТокенБота = Константы.ВКМ_ТокенTelegramБота.Получить();
	// ВКМ_Изменение_Начало
	ИдентификаторЧата = ВКМ_ОпределитьИдентификаторЧатаTelegram(Контрагент);
	// ВКМ_Изменение_Конец
	Если ПустаяСтрока(СокрЛП(ТокенБота)) Или ПустаяСтрока(СокрЛП(ИдентификаторЧата)) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Не определены параметры Telegram (токен или chat_id по контрагенту/по умолчанию).'");
		Возврат Результат;
	КонецЕсли;

	ИнтернетПрокси = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
		ИнтернетПрокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
	КонецЕсли;

	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , ИнтернетПрокси, 30,
		ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
	Запрос = Новый HTTPЗапрос("/bot" + ТокенБота + "/sendMessage");
	Запрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Запрос.УстановитьТелоИзСтроки(ВКМ_СформироватьJSONЗапросаTelegram(ИдентификаторЧата, ТекстУведомления), КодировкаТекста.UTF8);

	Попытка
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	Исключение
		Результат.ТекстОшибки = ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;

	Результат.КодСостояния = Ответ.КодСостояния;
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	Если Ответ.КодСостояния = 200 И СтрНайти(НРег(ТелоОтвета), """ok"":true") > 0 Тогда
		Результат.Успешно = Истина;
		Возврат Результат;
	КонецЕсли;

	Результат.ТекстОшибки = ?(ПустаяСтрока(ТелоОтвета),
		НСтр("ru = 'HTTP-ответ Telegram не содержит тела.'"),
		ТелоОтвета);
	Возврат Результат;

КонецФункции

Процедура ВКМ_ОбработатьРегламентныеУведомления() Экспорт

	// ВКМ_Изменение_Начало
	// Регламентная обработка только отправляет уже поставленные уведомления.
	// Источник постановки в очередь - явный вызов из документа ВКМ_ОбслуживаниеКлиента.
	// ВКМ_Изменение_Конец

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Очередь.Период КАК Период,
	|	Очередь.ВКМ_Ключ КАК Ключ,
	|	Очередь.ВКМ_ДокументОснование КАК ДокументОснование,
	|	Очередь.ВКМ_Контрагент КАК Контрагент,
	|	Очередь.ВКМ_КоличествоПопыток КАК КоличествоПопыток,
	|	Очередь.ВКМ_ТекстУведомления КАК ТекстУведомления
	|ИЗ
	|	РегистрСведений.ВКМ_ОчередьУведомленийTelegram КАК Очередь
	|ГДЕ
	|	Очередь.ВКМ_Статус В (&Статусы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очередь.Период";
	СтатусыДляОтправки = Новый Массив;
	СтатусыДляОтправки.Добавить(НСтр("ru = 'Новый'"));
	СтатусыДляОтправки.Добавить(НСтр("ru = 'Ошибка'"));
	Запрос.УстановитьПараметр("Статусы", СтатусыДляОтправки);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// ВКМ_Изменение_Начало
		Если НЕ ВКМ_ЗахватитьУведомлениеВРаботу(Выборка) Тогда
			Продолжить;
		КонецЕсли;
		// ВКМ_Изменение_Конец

		РезультатОтправки = ВКМ_ОтправитьУведомлениеВТелеграм(Выборка.Контрагент, Выборка.ТекстУведомления);
		Если РезультатОтправки.Успешно Тогда
			ВКМ_ОбновитьСтатусУведомления(Выборка, НСтр("ru = 'Отправлено'"), "", Ложь);
		Иначе
			ВКМ_ОбновитьСтатусУведомления(Выборка, НСтр("ru = 'Ошибка'"), РезультатОтправки.ТекстОшибки, Истина);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ВКМ_РассчитатьНДФЛ(СуммаНачисления) Экспорт

	Если СуммаНачисления <= 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Окр(СуммаНачисления * 0.13, 2);

КонецФункции

Процедура ВКМ_ДобавитьУведомлениеВОчередь(ДокументОснование, Контрагент, ТекстУведомления) Экспорт

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Или НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(ТекстУведомления)) Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.ВКМ_ОчередьУведомленийTelegram.СоздатьНаборЗаписей();
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.ВКМ_Ключ = Новый УникальныйИдентификатор;
	НоваяЗапись.ВКМ_ДокументОснование = ДокументОснование;
	НоваяЗапись.ВКМ_Контрагент = Контрагент;
	НоваяЗапись.ВКМ_ТекстУведомления = Лев(ТекстУведомления, 500);
	НоваяЗапись.ВКМ_Статус = НСтр("ru = 'Новый'");
	НоваяЗапись.ВКМ_ТекстОшибки = "";
	НоваяЗапись.ВКМ_КоличествоПопыток = 0;
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ЗаполнитьОчередьУведомлений()

	// ВКМ_Изменение_Начало
	// Автопостановка уведомлений из РеализацияТоваровУслуг отключена.
	// Очередь наполняется только через ВКМ_ДобавитьУведомлениеВОчередь
	// из документа ВКМ_ОбслуживаниеКлиента.
	Возврат;
	// ВКМ_Изменение_Конец

КонецПроцедуры

Функция ВКМ_ОпределитьИдентификаторЧатаTelegram(Контрагент)

	ИдентификаторЧатаКонтрагента = ВКМ_ПолучитьИдентификаторЧатаКонтрагента(Контрагент);
	Если НЕ ПустаяСтрока(СокрЛП(ИдентификаторЧатаКонтрагента)) Тогда
		Возврат ИдентификаторЧатаКонтрагента;
	КонецЕсли;

	Возврат Константы.ВКМ_ИдентификаторЧатаTelegram.Получить();

КонецФункции

Функция ВКМ_ПолучитьИдентификаторЧатаКонтрагента(Контрагент)

	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "";
	КонецЕсли;

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Маршрутизация.ВКМ_ИдентификаторЧата КАК ВКМ_ИдентификаторЧата
		|ИЗ
		|	РегистрСведений.ВКМ_МаршрутизацияTelegramКонтрагентов КАК Маршрутизация
		|ГДЕ
		|	Маршрутизация.ВКМ_Контрагент = &Контрагент
		|	И НЕ ПустаяСтрока(Маршрутизация.ВКМ_ИдентификаторЧата)
		|УПОРЯДОЧИТЬ ПО
		|	Маршрутизация.Период УБЫВ";
		Запрос.УстановитьПараметр("Контрагент", Контрагент);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ВКМ_ИдентификаторЧата;
		КонецЕсли;
	Исключение
		Возврат "";
	КонецПопытки;

	Возврат "";

КонецФункции

Функция ВКМ_МаксимумПопытокОтправкиУведомления()

	Возврат 5;

КонецФункции

Функция ВКМ_ЗахватитьУведомлениеВРаботу(СтрокаОчереди)

	НачатьТранзакцию();
	Попытка
		ВКМ_ЗаблокироватьЗаписьОчереди(СтрокаОчереди.Период, СтрокаОчереди.Ключ);

		МенеджерЗаписи = РегистрыСведений.ВКМ_ОчередьУведомленийTelegram.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = СтрокаОчереди.Период;
		МенеджерЗаписи.ВКМ_Ключ = СтрокаОчереди.Ключ;
		МенеджерЗаписи.ВКМ_ДокументОснование = СтрокаОчереди.ДокументОснование;
		МенеджерЗаписи.ВКМ_Контрагент = СтрокаОчереди.Контрагент;
		МенеджерЗаписи.Прочитать();

		СтатусыДляОбработки = Новый Массив;
		СтатусыДляОбработки.Добавить(НСтр("ru = 'Новый'"));
		СтатусыДляОбработки.Добавить(НСтр("ru = 'Ошибка'"));
		Если СтатусыДляОбработки.Найти(МенеджерЗаписи.ВКМ_Статус) = Неопределено Тогда
			ЗафиксироватьТранзакцию();
			Возврат Ложь;
		КонецЕсли;

		КоличествоПопыток = ?(ЗначениеЗаполнено(МенеджерЗаписи.ВКМ_КоличествоПопыток), МенеджерЗаписи.ВКМ_КоличествоПопыток, 0);
		Если КоличествоПопыток >= ВКМ_МаксимумПопытокОтправкиУведомления() Тогда
			МенеджерЗаписи.ВКМ_Статус = НСтр("ru = 'Отказ'");
			МенеджерЗаписи.ВКМ_ТекстОшибки = НСтр("ru = 'Превышен лимит попыток отправки уведомления.'");
			МенеджерЗаписи.Записать();
			ЗафиксироватьТранзакцию();
			Возврат Ложь;
		КонецЕсли;

		МенеджерЗаписи.ВКМ_Статус = НСтр("ru = 'ВРаботе'");
		МенеджерЗаписи.ВКМ_ТекстОшибки = "";
		МенеджерЗаписи.Записать();
		ЗафиксироватьТранзакцию();
		Возврат Истина;
	Исключение
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Процедура ВКМ_ЗаблокироватьЗаписьОчереди(Период, Ключ)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ВКМ_ОчередьУведомленийTelegram");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Период", Период);
	ЭлементБлокировки.УстановитьЗначение("ВКМ_Ключ", Ключ);
	Блокировка.Заблокировать();

КонецПроцедуры

Функция ВКМ_СформироватьJSONЗапросаTelegram(ИдентификаторЧата, ТекстУведомления)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Новый Структура("chat_id, text", ИдентификаторЧата, ТекстУведомления));
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

Процедура ВКМ_ОбновитьСтатусУведомления(СтрокаОчереди, Статус, ТекстОшибки, УвеличитьКоличествоПопыток = Ложь)

	// ВКМ_Изменение_Начало
	НачатьТранзакцию();
	Попытка
		ВКМ_ЗаблокироватьЗаписьОчереди(СтрокаОчереди.Период, СтрокаОчереди.Ключ);

		МенеджерЗаписи = РегистрыСведений.ВКМ_ОчередьУведомленийTelegram.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = СтрокаОчереди.Период;
		МенеджерЗаписи.ВКМ_Ключ = СтрокаОчереди.Ключ;
		МенеджерЗаписи.ВКМ_ДокументОснование = СтрокаОчереди.ДокументОснование;
		МенеджерЗаписи.ВКМ_Контрагент = СтрокаОчереди.Контрагент;
		МенеджерЗаписи.Прочитать();

		КоличествоПопыток = ?(ЗначениеЗаполнено(МенеджерЗаписи.ВКМ_КоличествоПопыток), МенеджерЗаписи.ВКМ_КоличествоПопыток, 0);
		Если УвеличитьКоличествоПопыток Тогда
			КоличествоПопыток = КоличествоПопыток + 1;
		КонецЕсли;

		Если УвеличитьКоличествоПопыток
			И КоличествоПопыток >= ВКМ_МаксимумПопытокОтправкиУведомления() Тогда
			Статус = НСтр("ru = 'Отказ'");
		КонецЕсли;

		МенеджерЗаписи.ВКМ_КоличествоПопыток = КоличествоПопыток;
		МенеджерЗаписи.ВКМ_Статус = Статус;
		МенеджерЗаписи.ВКМ_ТекстОшибки = Лев(ТекстОшибки, 300);
		МенеджерЗаписи.Записать();

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	// ВКМ_Изменение_Конец

КонецПроцедуры

#КонецОбласти

#КонецЕсли
